[
  "I seek out challenges that prove my value and lead to recognition from others.",
  "I try to redirect energy away from emotions toward the achievement of goals instead.",
  "I tend to take on the persona and image that gains acceptance and helps me achieve my goals.",
  "I pursue goals and tasks that offer a sense of accomplishment.",
  "I look to others to give me feedback on how well I am doing.",
  "People should focus on their goals and how to attain them.",
  "I feel pressure to perform well and succeed, to be accomplished.",
  "Emotions get in the way of productivity.",
  "My identity forms around what brings success.",
  "I like to be successful and admired.",
  "I avoid failure.",
  "I feel valued when people recognize my accomplishments and achievements.",
  "It can be difficult for me to allow myself to sit with and feel my emotions.",
  "Emotions can get in the way of achieving results so I try to redirect that energy toward the accomplishment of goals instead. I tend to present myself so that I will be accepted and recognized by the culture in which I am trying to succeed. I also try to maintain a positive can-do attitude.",
  "I am a very action-oriented person.",
  "I am a self-starter; lack of motivation was never a problem.",
  "Other people find me inspiring.",
  "I pack my vacations with activity.",
  "It’s very difficult for me to feel negative feelings and not act.",
  "I approach my romantic relationship as an active project.",
  "I want to feel in control.",
  "I am a hard worker.",
  "I have high self-esteem.",
  "I dress for success.",
  "Overall, I am a positive person.",
  "Yes, I want high standing in my social circle.",
  "I am a natural problem-solver.",
  "I have a practical approach to life.",
  "The way I feel about myself depends on what other people think of me.",
  "I want to be admired.",
  "I am a careerist.",
  "Accumulating status symbols has always been important to me.",
  "I enjoy being at the center of things.",
  "It’s extremely important to me that I am credited for my work.",
  "I am very concerned about how I come across.",
  "I gave up what I truly enjoy doing because it isn’t prestigious, doesn’t bring good money, etc.",
  "Even if I am not yet successful, I want to at least look the part.",
  "I always think about the future.",
  "I don’t like it when meetings drag on too long.",
  "Frankly speaking, my mood depends on how much I earn.",
  "I need to know that I can handle challenges.",
  "I only wear premium or luxury clothing.",
  "Sometimes I pretend to be busier than I actually am. I am doing this to make others think of me as someone important and valuable.",
  "I want to make sure that others know how many awards, degrees, certificates, etc., I have.",
  "I don’t allow friends to vent to me.",
  "Even though I want others to know how successful I am, I avoid talking about my achievements out of fear of coming across as vain, OR I constantly talk about my accomplishments and credentials because I want others to know that I am successful.",
  "Taking time off work feels uncomfortable.",
  "I work even on vacation.",
  "I feel stressed and pressured, but I keep going anyway.",
  "My appearance is very important to me.",
  "I avoid being idle because it makes all my uncomfortable feelings emerge.",
  "The best way to get love and approval is to perform — to look good, be productive, have things to offer, and do all the right things to appeal to others.",
  "I have to-do lists for my vacations as well; they include places I want to visit and things I want to do. There is a schedule for every day.",
  "Competing is my second nature.",
  "I am a fast learner.",
  "I don’t think much about the past.",
  "I guess I am materialistic, at least somewhat.",
  "I compare myself to others, especially those who have more than me or are doing better than me.",
  "I am into self-improvement.",
  "It’s important to me that my family members look presentable.",
  "I network to increase my chances of success.",
  "I am efficient.",
  "I accumulate assets and possessions.",
  "I identify with my job.",
  "I would describe myself as ambitious.",
  "I need to be self-reliant.",
  "I am not into talking about feelings because it doesn’t feel productive.",
  "I don’t waste time overthinking things; I begin to work right away.",
  "I’ve always been fascinated by status and prestige.",
  "I can’t just relax, sit, and talk because I think about all the tasks I have to do.",
  "If I don’t think I can win, I don’t get involved.",
  "I hide my weaknesses.",
  "I am concerned about the possibility of losing my lifestyle, and that makes me want to work even more.",
  "I read the needs of other people and adjust accordingly.",
  "I am an expert at multitasking.",
  "I have it all together.",
  "I know how to talk to different types of people.",
  "Getting things done has a beneficial impact on my well-being.",
  "I don’t usually talk about it, but in many cases, I feel superior to others.",
  "I want to be associated with other successful people.",
  "I need to feel productive.",
  "I suppress emotions, such as anger, anxiety, doubt, and sometimes even love, because they impair my ability to function properly.",
  "I sometimes get this uncomfortable feeling that there is not enough time to do everything I want to do.",
  "I can adjust my behavior to what different people may want to see. In that sense, I am chameleon-like.",
  "I set goals for everything.",
  "I must admit I name-drop whenever I have a chance.",
  "I always focus on getting to the point. I wish others did the same.",
  "I always feel the need to impress others.",
  "I often choose quantity over quality.",
  "I am energetic.",
  "I don’t focus on perfection, but the job needs to be done.",
  "I want to be wealthy.",
  "I have to be first.",
  "I am a leader.",
  "I am a very result-oriented person.",
  "I make sure to project high status.",
  "I develop many skills to ensure job security.",
  "I have a certain routine to help me do my chores in the shortest amount of time possible.",
  "I measure my success by tangible achievements.",
  "I get angry when someone or something interrupts me when working.",
  "I keep my eyes on the prize.",
  "I must admit I have problems with workaholism.",
  "Maybe I am a little narcissistic.",
  "Knowing that someone has a negative impression of me makes me feel very uneasy.",
  "I can be very persistent when I want something.",
  "I want to feel valuable.",
  "I constantly promote myself.",
  "I am terrified of the idea of being unable to work to support myself.",
  "I become anxious when I stop working.",
  "I eat quickly to avoid wasting time.",
  "I provide for my family.",
  "Once I complete a project, I look for another one.",
  "I just assume I have what it takes to complete my tasks.",
  "When I want to do something, I just jump right in and figure out the details as I go.",
  "It’s important for me to come across as a winner.",
  "I love walking in a room and knowing I’m making a great first impression on the crowd.",
  "I could persuade Bill Gates to buy a Mac.",
  "The keys to my happiness are efficiency, productivity and being acknowledged as the best.",
  "I don’t like it when people slow me down.",
  "I know how to airbrush failure so it looks like success.",
  "I’d rather lead than follow any day.",
  "I am competitive to a fault.",
  "I can find a way to win over and connect with just about anyone.",
  "I’m a world-champion multitasker.",
  "I keep a close watch on how people are responding to me in the moment.",
  "It’s hard for me to not take work along on vacation.",
  "It’s hard for me to name or access my feelings.",
  "I’m not one to talk much about my personal life.",
  "Sometimes I feel like a phony.",
  "I love setting and accomplishing measurable goals.",
  "I like other people to know about my accomplishments.",
  "I like to be seen in the company of successful people.",
  "I don’t mind cutting corners if it gets the job done more efficiently.",
  "People say I don’t know how or when to stop working.",
  "I see myself as a highly competent person: it really bothers me when I am anything less than effective and efficient.",
  "When things are going well for me, I virtually “glow” with a kind of inner joy in being who I am and having the life that I have.",
  "I try to present myself to others in the best possible light—but doesn’t everyone?",
  "My feelings have tended to be foreign to me—I feel things strongly for a little while, and then just get on with things.",
  "It’s important to me to feel successful, even if I’m not yet the success I want to be.",
  "For better or for worse, I am good at covering up my insecurities—people would never guess what I’m really feeling!",
  "I want to make a good impression on people, so I’m usually polite, well-mannered, and friendly.",
  "I am aware of how well my friends and colleagues are doing, and I tend to compare myself to them.",
  "I often strive to be the best at what I’m doing—if I can’t be outstanding at something, I generally don’t bother with it.",
  "Sometimes I’ve had to cut corners a little to achieve my goals.",
  "When I am insecure, I can be rather aloof and cool with people.",
  "It really bothers me when others don’t acknowledge the excellence of what I’ve done.",
  "I’m more adaptable than most: if things aren’t working well, I know how to change my behavior to obtain the results I want.",
  "I always have a goal in focus and know how to motivate myself to achieve it.",
  "I have a workaholic streak—I feel adrift if I’m not accomplishing things."
]