[
    "I protect myself against intrusion and hoard resources or minimize needs to avoid dependency on others.",
    "I often find myself observing and analyzing the world around me instead of actively participating in it.",
    "I may not be able to fully process all that's going in the moment and need time to reflect in order to complete that processing.",
    "I often observe and analyze the world around me instead of actively participating in it.",
    "I tend to hoard resources so as not to become dependent on others.",
    "I am observant.",
    "People should be objective and logical.",
    "I prepare for the future by becoming as knowledgeable as I can.",
    "I like having time to think by myself.",
    "People sometimes see me as aloof.",
    "Others can be intrusive.",
    "I dislike intrusions upon my thinking.",
    "It can be difficult to fully participate in what is going on around me because there is a part of me that pulls back to objectively observe and try to comprehend things. I can sometimes feel a bit overwhelmed when expected to come up with an immediate response before I have had a chance to process things. I often need some time and space to think things through first.",
    "I don’t want people to expect much from me.",
    "I love my independence.",
    "I am not too worried about how I come across.",
    "I am not very generous.",
    "I have very few or no friends.",
    "If I am forced to accept someone’s help, I immediately buy thank-you gifts to stop feeling indebted.",
    "If my feelings get hurt, I just try to think about something else until it doesn’t hurt anymore.",
    "I have fewer possessions than other people, and it’s enough for me.",
    "Keeping things private is one of my top priorities.",
    "I just feel less prepared for life than other people.",
    "When working with others, I want everything to be precise and defined, e.g., goals, responsibilities, time.",
    "I don’t do small talk.",
    "Breaking up doesn’t seem to be particularly difficult.",
    "To make a decision, I carefully consider and analyze all options.",
    "I need to keep my brain busy.",
    "I get particularly excited about special information that isn’t available to everyone.",
    "I am more motivated by the desire for security, privacy, and knowledge than for image, prestige, and social needs.",
    "I don’t need approval from others, but it’s nice to feel that my accomplishments are appreciated.",
    "I can watch emotional scenes without getting affected.",
    "I don’t offer too much personal information and only answer questions instead.",
    "I avoid drama as much as I can.",
    "I use my resources economically.",
    "I need to spend plenty of time alone to recharge.",
    "Even though I like to be alone, I sometimes get secretly lonely. I wish I could meet someone interesting.",
    "I want to become an expert in several fields.",
    "I seldom feel lonely.",
    "I dress for comfort rather than fashion.",
    "When I feel emotions, I try not to display them as much as possible.",
    "I don’t want to get too attached to others.",
    "If I judge others, it’s usually because I think they are not smart enough or didn’t do their research.",
    "I just love researching and processing information.",
    "I want to look competent.",
    "I limit contact with the outside world because my time, energy, and emotions are limited.",
    "I don’t talk a lot unless it’s one of the topics I am interested in.",
    "I withdraw from others because I need time and space to think.",
    "I don’t expect anyone to take care of me.",
    "Sometimes I ask questions just to keep the other person talking so that I don’t have to share my personal information.",
    "I avoid asking for help as much as possible.",
    "I observe the world, notice patterns and try to predict likely outcomes based on what I see.",
    "I keep my neighbors at arm’s length.",
    "I often can’t guess people’s emotions, preferences, or hidden meanings correctly.",
    "I spend a lot of time alone.",
    "Sometimes I am so busy with my thoughts that I become absent-minded. I misplace my keys, forget appointments, neglect my appearance, and stop interacting with my family.",
    "I am just not interested in average social gatherings with their small talk and trivial conversations.",
    "I need to understand, analyze and categorize things before getting involved, but by the time I do that, there is usually no desire to get involved anymore.",
    "I avoid revealing my needs.",
    "One of my greatest fears regarding relationships is that someone will demand that I give up on my projects or that I will be somehow drawn off course.",
    "I want to be able to disappear for a while without having to explain anything to anyone.",
    "I prefer to keep different areas of my life separate. For example, I do not introduce my friends from one area of interest to my other friends from another area of interest.",
    "I am not into physical activity and exercise.",
    "Usually, I work out everything in my mind before acting.",
    "I protect my time and space.",
    "I avoid people who try to dominate me.",
    "I live inside my head.",
    "I am actually very attracted to people. Yet, I can’t help but keep my guard up.",
    "People accuse me of being unfeeling, and it bothers me a lot.",
    "I avoid getting into relationships with people who have too many needs.",
    "It’s like I observe life from a distance.",
    "I can stay calm in a crisis situation.",
    "Having my personal space feels almost as vital as oxygen.",
    "I can get by on very limited supplies.",
    "Sometimes I have a lot to say, but I don’t bother because I don’t expect them to understand.",
    "I can’t handle too much personal sharing and avoid people who share excessively.",
    "I try to look at things objectively.",
    "I retreat into my mind and isolate myself as a way to protect myself because the outside world can seem too demanding and draining.",
    "I use both tried-and-true methods and novel approaches.",
    "I don’t want to become too emotional.",
    "I don’t want to waste my time and energy on other people’s agendas.",
    "I am somewhat socially awkward.",
    "I really value boundaries.",
    "I am a minimalist.",
    "I am a very self-sufficient person.",
    "Generally, I live an isolated life.",
    "I am not interested in leadership, but I would gladly build strategies, analyze and research while someone else leads.",
    "I am wary of others’ feedback because it might be distorted by their personal perceptions and agendas.",
    "I focus on knowledge.",
    "Generally, I feed my mind more than my body. In fact, sometimes I forget to eat.",
    "I want to understand how things work.",
    "I try my best not to depend on anyone.",
    "I have little tolerance for overly emotional people.",
    "I often freeze when something unexpected happens.",
    "I enjoy being regarded as the one who “knows stuff”.",
    "I don’t always know what’s appropriate socially.",
    "Experiencing strong emotions feels like I am losing control.",
    "I would rather work alone.",
    "After-work dinners and socializing with colleagues don’t seem attractive at all.",
    "Accumulating knowledge helps me survive.",
    "I keep other people’s secrets.",
    "Even as a child, I preferred my own company.",
    "I often avoid giving direct answers when asked about myself.",
    "Very often, I would rather observe than participate.",
    "I am a little bit of a hoarder.",
    "Many people want from me more than I am willing to give.",
    "Most of the time, spontaneity feels uncomfortable.",
    "I often withhold information unless I am asked direct and specific questions.",
    "I take pleasure in doing with less. To me, it’s another level of freedom.",
    "I avoid conflict as well as most other emotional situations.",
    "I avoid making emotional decisions.",
    "I often feel like I didn’t study enough, didn’t read enough, or didn’t practice enough to make the first step toward something.",
    "I want to figure out others. I want to know what makes people tick.",
    "I can take care of myself, and I think others could do the same.",
    "I don’t always say things out loud, but in my head I am pretty sarcastic and cynical.",
    "I often feel awkward around other people.",
    "I’m okay if people ask me a few specific questions about myself, but I don’t like it when people want too much information.",
    "I need alone time.",
    "If I want people to know how I feel I will them. I generally wish they wouldn’t ask.",
    "I think thoughts are more reliable than feelings.",
    "I need a couple of days to process an experience or know how I feel about something.",
    "People are wasteful. I hold on to what I have.",
    "Often I find that I would rather observe than participate.",
    "I trust myself. That means I think about things for a while and then I make my own decisions.",
    "I can’t understand why people get together to just “hang out”.",
    "I’m a listener.",
    "I have to be very careful with my time and energy.",
    "I get tired when I have to be with people for too long.",
    "I often felt invisible as a child. Sometimes as an adult I choose to be invisible.",
    "Sometimes I think I should be more generous. It’s hard for me.",
    "In groups, being uninformed makes me very uncomfortable.",
    "I don’t like big social gatherings. I’d rather be with a few people.",
    "Material possessions don’t make me happy.",
    "I like to get into things in depth and pore over details until I’ve figured something out as completely as possible.",
    "I am an extremely private person who doesn’t let many people into my world.",
    "I do not feel very big or powerful—more small and invisible: I’d make a good spy!",
    "Other people would think I’m crazy if they knew what I was thinking most of the time.",
    "Only by getting accurate information can you make a rational decision—but then, most people aren’t really rational.",
    "My family thinks that I am somewhat strange or eccentric—they’ve certainly told me that I need to get out more.",
    "I can talk a blue streak when I want to; most of the time, though, I prefer to just watch all the craziness around me.",
    "If you need a problem solved, let me work on it by myself, and I’ll come up with the answer.",
    "When you really think about it, you can’t get much stranger than so-called normal behavior.",
    "I tend to take a long time fine-tuning projects I’m working on.",
    "Most people are so incredibly ignorant, it’s amazing that anything works at all!",
    "I know a lot about a lot of things, and in a few areas, I consider myself an expert.",
    "I am extremely curious and enjoy investigating why things are the way they are—even obvious things are not really so obvious when you really look at them.",
    "My mind is so intense and active that I often feel like it’s on fire.",
    "Often I lose track of time because I’m concentrating so completely on what I’m doing."
  ]