[
    "I tend to be dissatisfied with what's common or ordinary and long for what once was or could have been.",
    "I'm sensitive to my own internal emotional reality and look for ways to express and share that.",
    "I often feel other people are more capable or fulfilled than I am and have something I don't.",
    "I look for ways to express what is emotionally meaningful to me.",
    "I notice what others have or are that I do not have or am not.",
    "People should cultivate what makes them unique individuals.",
    "I feel pressure to be like everyone else even though I am not.",
    "I get absorbed in my own emotions.",
    "My identity forms around an authentic sense of who I am.",
    "I like to be authentic and significant.",
    "I avoid the ordinary.",
    "I feel valued when people find significant what makes me unique and special.",
    "It can be difficult for me to find a sense of fulfillment or completeness in my life.",
    "When I look at other people I notice how they have something I do not or are something I am not. It feels like I am lacking something in comparison. Because I cannot be like them I cultivate what is unique and authentic about me and try to find my own significance through that.",
    "I am a very emotional person.",
    "I want to connect with others on a deeper level.",
    "I have good taste.",
    "I can be vulnerable and strong at the same time.",
    "I want to live out the most romantic fantasies.",
    "I can be pretty moody.",
    "I want to be an important person in my field.",
    "Sometimes I take care of others' pain so that I don't have to deal with my own.",
    "Aesthetics are extremely important to me.",
    "I am sensitive to other people's feelings and needs.",
    "When dealing with personal problems, I am almost unable to focus on work.",
    "I spend a lot.",
    "My friends, family, and colleagues all seem to enjoy life because they have something I don't have.",
    "Others can be open with me.",
    "After acquiring what I wanted, I often feel that I made a mistake and that happiness lies elsewhere.",
    "I get irritated easily.",
    "Because I understand emotions so well, I can support others when they are going through a difficult time.",
    "Sometimes I can't make up my mind regarding whether I want to fit in or be different.",
    "I tend to be on the serious side.",
    "My work has to be special or unique in some way.",
    "I feel abandoned.",
    "I actually enjoy sad movies.",
    "I don't feel complete.",
    "I am an empath.",
    "I don't hesitate to express my real feelings.",
    "The glass is half-empty.",
    "I like to help others, and I do so very generously.",
    "The atmosphere is so important to me; I pay attention to lighting, color scheme, and other details to make my environment perfect.",
    "I often notice subtle details that others miss.",
    "I tend to idealize my long-distance relationship but become very disappointed when we are together.",
    "I must admit I am overly dramatic at times.",
    "I transform my experiences into something beautiful — a piece of art, a poem, a film, or a book.",
    "When I am with others, I focus on how I am different from them.",
    "I am extremely sensitive to criticism.",
    "I am looking for love.",
    "I secretly worry that I am easily replaceable.",
    "I often feel misunderstood.",
    "I want to be discovered for my unique qualities.",
    "I want to be true to my feelings.",
    "Usually, I wait until somebody approaches me rather than approaching people myself.",
    "I am very interested in other people's feelings.",
    "I might leave a relationship because I am not loved the way I want to be loved or because I don't get as much attention as I would like.",
    "I am not your girl/boy next door.",
    "I am very artistic.",
    "Sometimes I think that I ask for more than I can get as a way to protect myself from disappointment. If I can't get it, it can't disappoint me.",
    "I am not interested in controlling other people.",
    "Frankly speaking, I often compare myself to others and feel deficient as a result.",
    "I think about the past very often.",
    "I want to discover my authentic self.",
    "I focus on what would make the situation better but is missing.",
    "I need to feel inspired to work.",
    "I feel like I am not getting enough care, attention, recognition, support, etc.",
    "I collect special moments.",
    "Mundane tasks, such as going to work, doing chores, using public transport, and grocery shopping, seem so difficult and out of character.",
    "I wonder how other people can feel so content.",
    "I have irrational feelings that I don't understand myself.",
    "I throw pity parties quite often.",
    "I don't shy away from painful emotions and allow myself to feel them deeply.",
    "I play hard to get.",
    "To be completely honest, I often indulge in unfavorable comparisons. For example, I often judge people for their 'bad' taste or criticize them for their career choices or partner choices. I would think, 'I could never wear something like that,' or 'I could never be with a person like that.'",
    "I make things beautiful.",
    "I want to be loved for who I am.",
    "I don't hide my weaknesses.",
    "I feel personally attacked when someone questions my ideas.",
    "I express myself through art.",
    "I enjoy long conversations with those who understand me.",
    "I wish my family had acknowledged my talents when I was still a child.",
    "I dream a lot. In my fantasy world, I have all the physical attributes I admire in others, have all the materialistic things I ever wanted, and have my perfect relationship where I am loved and cherished the way I always wanted.",
    "I am particularly worried about being rejected.",
    "I often feel that things come easily to other people but not me.",
    "Sometimes, I get very jealous.",
    "I make sure that my speech and manner are refined.",
    "I fear that I won't be pursued if I am not special enough.",
    "I tend to dwell on the negative.",
    "I am a very introspective person. I want to understand what exactly I feel.",
    "I want to come across as unique.",
    "I want to be my true self.",
    "Sometimes I reject people so that they can't reject me.",
    "I have a unique clothing style that makes me stand out.",
    "I tend to tell a lot of personal stories.",
    "Frankly speaking, I secretly enjoy a little bit of inner drama.",
    "I am often surprised by positive feedback because it is not something I normally expect.",
    "I want more intensity; otherwise, I feel so incredibly bored.",
    "I feel irritated when people suggest I lighten up or watch a funny movie.",
    "I have a history of on-again, off-again relationships.",
    "I experience a lot of inner turmoil.",
    "I want special attention.",
    "I am often told that I overreact.",
    "There are so many crises in my life.",
    "I am not a shallow type.",
    "I can be a little bit of a snob sometimes.",
    "Honestly, I do blame others for holding me back.",
    "I want to be appreciated for my good looks.",
    "I am haunted by a sense of longing.",
    "Sometimes I dream that one day, somebody will come and rescue me from my problems.",
    "I tend to take things personally.",
    "I decorate my home with unique or unusual objects.",
    "I have special needs that most other people don't have.",
    "My emotional suffering sets me apart from my friends, colleagues, and family.",
    "I guess I am high maintenance.",
    "I like things that are unconventional, dramatic and refined. I’m definitely not a fan of the ordinary.",
    "I never really felt like I belonged.",
    "I have so many feelings in a day it's hard to know which ones to pay attention to first.",
    "Some people think I’m aloof, but I’m really just unique.",
    "In social situations I tend to hang back and wait for others to approach me.",
    "Melancholy is comfortable for me, so it’s annoying when people try to cheer me up.",
    "I’m not everyone else…phew.",
    "I’m very sensitive to criticism, and it takes me a while to get over it.",
    "I spend a lot of time trying to explain myself.",
    "When people tell me what to do I’m often tempted to do the opposite.",
    "Sometimes I just disappear and go radio silent for a few days.",
    "I’m okay with sad songs, sad stories and sad movies. Overly happy people give me a headache.",
    "I feel there is something essential lacking in me.",
    "It’s really hard for me to settle into a relationship because I’m always looking for my ideal soul mate.",
    "I’m self-conscious. It’s hard for me to find my place in a room full of people.",
    "People say I’m too intense and my feelings overwhelm them.",
    "I’m either an artist or highly creative. I come up with one amazing, creative idea after another. It’s executing them that’s hard.",
    "Lots of people misunderstand me, and it makes me feel frustrated.",
    "I pull people in, but then I get nervous and push them away.",
    "I worry a lot about abandonment.",
    "Many people see me as enigmatic, difficult, and contradictory—and I like that about myself!",
    "I tend to brood over my negative feelings for a long time before getting free of them.",
    "I often feel alone and lonely, even when I’m around people I’m close to.",
    "If I’m criticized or misunderstood, I tend to withdraw and sulk.",
    "I find it difficult to get involved with projects if I don’t have creative control.",
    "I tend not to follow rules or to go along with expectations because I want to put my own special touch on whatever I do.",
    "By most standards, I’m fairly dramatic and temperamental.",
    "I tend to spend quite a bit of time imagining scenes and conversations that haven’t necessarily happened.",
    "I long for someone to rescue me and sweep me away from all this dreary mess.",
    "When things get tough, I tend to crumble and give up—perhaps I give up too easily.",
    "I can forgive almost anything except bad taste.",
    "Generally, I don’t enjoy working too closely with others.",
    "Finding myself and being true to my emotional needs have been extremely important motivations for me.",
    "I don’t like either to take the lead or to be a follower.",
    "I am acutely aware of my intuitions, whether or not I have the courage to act on them."
  ]