[
    "I often forget my own agenda when I'm with others because I tend to get carried along with what they're doing.",
    "I can have trouble deciding what I want and people can confuse my going along as agreement when I just haven't made up my mind yet.",
    "I try to find common ground between people in order to smooth things over and have everyone get along.",
    "I can get irritable and stubborn when others upset my peace.",
    "I can get pulled along by the desires and agenda of others.",
    "People need to get along with each other.",
    "I like keeping people in my life happy.",
    "I am good at considering multiple points of view and finding common ground.",
    "People may think I agree because I go along when I just have not made up my mind yet.",
    "I am easygoing.",
    "I like to smooth things over.",
    "I accommodate others.",
    "It can be difficult for me to set priorities and an agenda for myself especially when I am around other people. I tend to get pulled along with what others are doing. Going along does not necessarily mean I agree. It may just mean I have not made up my mind yet. If I am pushed to do something I do not want to then I may stubbornly dig in my heels or become passive aggressive.",
    "I am not weak or scared but prefer keeping things peaceful.",
    "I want to come across as likable.",
    "Sometimes I just can’t make a decision.",
    "I get energized by other people’s enthusiasm for work.",
    "I am very much into natural healing.",
    "I am satisfied with what I have.",
    "I never self-promote.",
    "I prefer comfortable clothing; fashion isn’t very important to me.",
    "I can communicate with very different people.",
    "There are very few conflicts in my life.",
    "I fear losing a sense of inner balance.",
    "I look for win-win options.",
    "Typically, I hide my negative feelings.",
    "I want to maintain my comfort. Period.",
    "I don’t want to make waves.",
    "I am very cautious about taking risks.",
    "I postpone expressing my opinion until I get things figured out.",
    "I enjoy simple pleasures in life.",
    "Sometimes I get in autopilot mode and accomplish an enormous amount of work.",
    "I love my routine and find it very comforting and relaxing.",
    "I would rather go with what has worked in the past.",
    "I often don’t know what I want, but I usually know what I don’t want.",
    "I don’t do office politics and intrigues.",
    "My wishes are often put aside to accommodate others’ wishes.",
    "I am very flexible and adaptable and can work different types of jobs.",
    "I must admit, I avoid dealing with my problems.",
    "I am definitely one of the least controlling people you will ever meet.",
    "The idea that somebody has to lose for me to win makes me uncomfortable.",
    "I am good at art or crafts.",
    "I don’t talk much about myself.",
    "Sometimes I don’t assert myself for the sake of keeping the peace.",
    "I resist when others try to disturb my peace.",
    "I am able to forget old disagreements and move on with my relationships.",
    "I can be very inattentive at times.",
    "I am attracted to assertive and energetic people.",
    "I prefer to work in an environment with well-defined tasks and procedures.",
    "I am a nature lover.",
    "At work, I appreciate structure and clearly defined tasks, but at the same time, I don’t want to be told what to do.",
    "At work or at home, I just want to keep things as they are.",
    "Being trusting is my default mode of operation.",
    "I am not a very demanding person.",
    "If the conversation becomes unpleasant, I simply try to change the subject.",
    "I don’t usually enjoy the company of people who are too intense or aggressive.",
    "I often choose to compromise.",
    "I learned to be satisfied with what I have.",
    "I am a natural team player.",
    "When stressed, I tend to put my energy into unimportant tasks instead of dealing with the real problem.",
    "Usually, I can see different sides of an issue, and they all seem important.",
    "I am very laid-back in general.",
    "I tend to get stuck in inertia.",
    "I am good at sports or anything physical.",
    "I live in the here-and-now.",
    "I get angry only occasionally or never.",
    "When there is too much pressure and stress, I might freeze and stay idle instead of doing something.",
    "I mediate conflicts.",
    "I get along with most people.",
    "I am not concerned about status or prestige.",
    "I don’t want to draw too much attention to myself.",
    "I want to be myself; I don’t like pretentious people.",
    "I want to be respectable.",
    "I want to be humble and appreciate humbleness in others.",
    "I have a very stable mood, without ups and downs.",
    "Other people take credit for my work, and I don’t do anything about it.",
    "Maybe it’s true that I am in denial regarding some disturbing aspects of my life, but I keep focusing on the positive.",
    "Generally, I feel at ease.",
    "Most of the time, I avoid conflict and go along with what others want as much as I can.",
    "I rarely express my opinions.",
    "I am not into goal setting. I just go with the flow.",
    "When my problems become too much, I tend to withdraw into my alternative world, watching movies, playing games, or reading.",
    "Often I go along with other people’s wishes and then realize that’s not what I want to do, but I didn’t know that initially.",
    "I don’t experience very intense emotions, positive or negative.",
    "I don’t like being around negative people.",
    "I experienced one or a few outbursts of anger and aggression in my life, and the experience was so frightening that I felt the need to shut down my anger even more firmly.",
    "My identity can change depending on what is required of me.",
    "When I don’t want to do something, I just kind of delay and “forget” to do it, but I don’t say “no” right from the start.",
    "I don’t want to examine my feelings out of fear of what I might find.",
    "I am often not taken seriously, and in all honesty, it’s hard on me.",
    "Overall, I am a positive person.",
    "I indeed get lazy and lethargic at times.",
    "I can be too trusting sometimes.",
    "I distract myself from negative emotions by keeping myself busy with small unessential tasks.",
    "I rarely confront someone who made a mistake; I just let it pass.",
    "I have an agreeable character.",
    "I am often confused.",
    "My relationships typically last for a very long time.",
    "I don’t worry too much.",
    "Generally, I avoid anything that disturbs my peace.",
    "I just want a peaceful home.",
    "I don’t necessarily express everything I feel and want some things to remain unsaid.",
    "I am never selfish, and I don’t like selfishness in others.",
    "I don’t dwell on the negative and forgive quickly.",
    "I am not competitive at all. In general, I feel like I have nothing to prove to anybody.",
    "I love peace and pick my fights.",
    "Honestly, I don’t expect too much from life.",
    "Sometimes I feel that no matter how much I try, my efforts aren’t valued, so I stop trying.",
    "I live a couch potato lifestyle.",
    "I want my co-workers to get along.",
    "I almost never overreact.",
    "Despite our differences, I prefer to cooperate with others.",
    "I think that most problems aren’t worth worrying about.",
    "I’ll do almost anything to avoid conflict.",
    "I’m not a self-starter.",
    "Sometimes I get lost doing trivial tasks, while things that really need to get done get put off.",
    "I’m happy to go along with what others want to do.",
    "I tend to procrastinate.",
    "People seem to want me to be more decisive.",
    "When I get distracted and go off task I give my attention to whatever is happening right in front of me.",
    "I often choose the path of least resistance.",
    "I find routines at work and home comforting, and I feel unsettled when something throws them off.",
    "Others see me as more peaceful than I really am.",
    "I have a hard time getting started, but once I do I really get things done.",
    "I’m a “what you see is what you get” person.",
    "I don’t think of myself as being very important.",
    "People think I’m a good listener even though I find it hard to pay attention in a long conversation.",
    "I don’t like to take work home with me.",
    "Sometimes I tune out and think about the past.",
    "I don’t enjoy big social gatherings as much as a quiet evening at home with the ones I love.",
    "Being outdoors is very soothing to me.",
    "I am often quietly stubborn when people put demands on me.",
    "It would feel selfish to spend a whole day doing whatever I want to do.",
    "What people seem to like about me is that they feel safe around me.",
    "I don’t mind being around people, and I don’t mind being alone—either way is fine, as long as I’m at peace with myself.",
    "I’ve found a certain balance to my life, and I see no reason to mess with it.",
    "Being “comfortable” in every sense of the word appeals to me a lot.",
    "I would rather give someone else their way than create a scene.",
    "I don’t know exactly how I do it, but I don’t let things get to me.",
    "I’m pretty easy to please and usually feel that what I have is good enough for me.",
    "I’ve been told that I seem distracted and absentminded—the fact is I understand things, but I just don’t want to react to them.",
    "I don’t think I’m particularly stubborn, but people say that I can be hard-headed once I make up my mind.",
    "Most people get themselves worked up too easily: I’m much more even-keeled.",
    "You’ve got to take what life brings, since there’s not much you can do about it anyway!",
    "I can easily see different points of view, and I tend to agree with people more than I disagree with them.",
    "I believe in emphasizing the positive rather than dwelling on the negative.",
    "I have what might be called a philosophy of life that guides me and gives me a great deal of comfort in difficult times.",
    "During the day, I do everything that needs to be done, but when the day is over, I really know how to relax and take it easy."
  ]