[
    "I take a direct approach in getting what I want and get frustrated and intolerant of obstacles that get in the way.",
    "I find myself assuming control in situations where there's a power vacuum or incompetent leadership.",
    "I avoid showing any vulnerabilities that people can take advantage of by standing strong against the world.",
    "I tend to go for what I want in a strong and direct way.",
    "I can be intolerant of and push through obstacles in my way.",
    "People need to stand up for themselves.",
    "I often find myself in leadership roles.",
    "I avoid showing any vulnerability that can be taken advantage of.",
    "People can be overwhelmed by my energy so I sometimes have to tamp it down.",
    "I am strong.",
    "I like to get things moving.",
    "I empower others.",
    "It can be difficult for me to give control over to others unless I know they are competent and fair. My tendency is to step in and take charge of a situation myself and push to get what I want instead of trusting others to do that for me. I find people can sometimes feel overwhelmed by my energy and I may have to tamp it down if I want them to feel more comfortable around me.",
    "I am full of energy.",
    "I overcome obstacles.",
    "For the most part, I am not particularly concerned with people’s reactions to me.",
    "Becoming and staying self-sufficient are some of my top priorities.",
    "I tend to overeat.",
    "I am able to stand up for what I need and want.",
    "I like to challenge myself.",
    "I take risks.",
    "I must admit I tend to order others around.",
    "I stay alert because I feel like there are a lot of people who are out to get me.",
    "I have strong opinions, and I express them openly.",
    "If I am not happy at work, I just quit.",
    "I often test limits and consequences.",
    "I can be very intense.",
    "I am a doer.",
    "I enjoy the outdoors.",
    "Sometimes I overpromise to get others on board with my goals.",
    "I am a provider.",
    "I don’t ask for help because I don’t want to feel indebted.",
    "I judge others in black-and-white terms.",
    "With me, what you see is what you get; I have no secrets.",
    "I hide my weaknesses because someone might take advantage of them.",
    "I take charge before somebody else does.",
    "I am pretty possessive about what I own.",
    "I am quite loud.",
    "I trust my abilities.",
    "I am not a very good team player.",
    "Many a time, I don’t think much before doing something.",
    "I am a big-picture thinker.",
    "I express my anger openly.",
    "I don’t do long-range planning. I can’t focus on things that are too far in the future.",
    "I am a generous person.",
    "Usually, I don’t ask for permission before doing something.",
    "I have no problem with saying “No”.",
    "I need a lot of stimulation. I constantly look for interesting things to do, new people to meet, challenges to overcome, etc.",
    "I make decisions very fast.",
    "I don’t try to please others. If they don’t like me, it’s OK.",
    "I do brag sometimes. I exaggerate my accomplishments or boast about my big plans.",
    "I often make decisions that involve other people in my life without consulting them.",
    "I observe others and pay attention to those with more power and control.",
    "I am independent.",
    "If I don’t like something in a store, hotel, or restaurant, I demand to see the manager.",
    "I want others to follow my rules.",
    "I am very ready to show aggression.",
    "I like a can-do attitude and encourage it in others.",
    "I don’t allow myself to become too sensitive.",
    "I protect the weak and vulnerable.",
    "I work hard and play hard.",
    "I can’t stand it when people don’t tell me everything openly. I will bug them until they speak straight.",
    "I get what I want.",
    "I drive too fast, overeat, party too much, or otherwise have issues with boundaries.",
    "I am not good at compromising.",
    "I am impatient.",
    "I don’t understand those who whine about their problems but don’t do anything about it.",
    "I want to do things my way.",
    "I see most people as my opponents.",
    "Anger feels like an energy surge.",
    "I am not nearly as bold as I appear to be.",
    "As a child, I couldn’t wait to grow up and be on my own.",
    "I trust my intuition.",
    "I am a loyal person.",
    "I am focused on the here and now.",
    "I often decide for others.",
    "I ignore physical pain.",
    "I am pretty assertive.",
    "I often say things I regret.",
    "I don’t hesitate to get physical if I think it can help.",
    "I am not afraid of confrontation.",
    "Well, I probably am a little bit of a bully.",
    "I prefer to attack first myself instead of waiting for someone to attack me.",
    "I am not afraid of hard work.",
    "Despite my confident exterior, I feel insecure and vulnerable inside.",
    "I am impulsive.",
    "I don’t beat around the bush; I say what I want to say.",
    "I am very result-oriented.",
    "I always need to have something to do to bleed off some extra energy.",
    "I am good at sports.",
    "I trust my own decisions.",
    "I often overdo things, such as staying out late, overeating, physical experiences, etc.",
    "I often enjoy fighting and arguing.",
    "I hide the feeling of insecurity, doubt, powerlessness from others and sometimes even from myself.",
    "I don’t complain; I fix my problems instead.",
    "I can be reckless at times.",
    "When I want something, I just do it and deal with the consequences later.",
    "I find it difficult to apologize.",
    "Sometimes I fight about things that aren’t even important to me.",
    "I am a realist.",
    "Other people seem so stubborn when they don’t want to do things my way.",
    "I don’t allow myself to become lazy.",
    "I am a natural leader.",
    "Once a confrontation begins, I never back down.",
    "I take revenge.",
    "My anger rises quickly and suddenly but disappears fast once I express it.",
    "I am stronger than most people I know.",
    "I am responsible with money.",
    "I am rebellious.",
    "I want to dominate and control others.",
    "I wake up angry.",
    "I enjoy building.",
    "I don’t trust easily. Generally, my trust has to be earned.",
    "I have been told that I’m too blunt and aggressive.",
    "Doing things halfway is not my spiritual gift.",
    "I enjoy a good verbal skirmish, just to see what others are made of.",
    "In relationships that matter to me I insist on being honest about conflicts and staying in the fight till things are worked out.",
    "It’s hard for me to trust people.",
    "Justice is worth fighting for.",
    "I can sniff out other people’s weakness the first time I meet them.",
    "Saying no isn’t a problem for me.",
    "I welcome opposition. Bring it.",
    "I make decisions fast and from the gut.",
    "I don’t like it when people beat around the bush.",
    "I’m wary of people who are super nice.",
    "When I walk into a room I immediately know who has the most power.",
    "I don’t have much respect for people who don’t stand up for themselves.",
    "One of my mottos is “A good offense is better than a good defense.”",
    "Don’t mess with the people I love.",
    "I know I’m respected. But sometimes I want to be loved.",
    "I have no problem confronting a bully.",
    "If God wanted people to wear their hearts on their sleeve, he would have put it there.",
    "Under my tough exterior is a tender, loving heart.",
    "I am extremely independent and don’t like having to rely on others for what I really need.",
    "I feel that “you have to break some eggs to make an omelet.”",
    "When I care about people, I often begin to think of them as “my people” and feel like I need to watch out for their interests.",
    "I know how to get results: I know how to reward people and how to put pressure on them to get things done.",
    "I do not have much sympathy for those that are weak and vacillating—weakness just invites trouble.",
    "I am strong-willed and do not give up or back down easily.",
    "I am never prouder than when I see someone I’ve taken under my wing make it on their own.",
    "I have a tender, even somewhat sentimental side that I show to very few people.",
    "People who know me appreciate the fact that I talk straight to them and tell them exactly what’s on my mind.",
    "I’ve had to work hard for everything I have—I think struggle is good because it toughens you up and makes you clear about what you want.",
    "I see myself as a challenger, as someone who pushes people beyond their comfort zone to achieve their best.",
    "My sense of humor is earthy, sometimes even crude, although I think most people are too prissy and thin-skinned.",
    "I can get into a towering rage, but it blows over.",
    "I feel most alive when I do what others think is impossible: I like to go to the edge and see if I can beat the odds.",
    "Somebody usually has to come up on the short end of the stick, and I don’t want it to be me."
  ]