[
    "I can be warm and friendly as a way to show I'm not a threat and to cultivate protective and trusting alliances with others.",
    "I can have difficulty knowing what or who I can trust which can generate skepticism, doubt, and questioning.",
    "I can vacillate in taking action until I find reassurance that it's the right course of action.",
    "I often have doubts and questions and look to others to find answers or resolution.",
    "I am sometimes friendly to others to show that I am not a threat to them.",
    "I am cautious.",
    "People should be vigilant and safe.",
    "I prepare for the future by anticipating what could go wrong.",
    "I like having time to ask questions.",
    "People sometimes see me as contrary.",
    "Others can be untrustworthy.",
    "I dislike inconsistency in others.",
    "It can be difficult for me to find certainty in moving forward by just relying on myself or trusting others blindly. I have a tendency to doubt myself and question others. I seek assurance by asking the opinions of others yet may also question or take a contrary point of view to what they tell me in an attempt to uncover flaws or hidden motives in what they are saying.",
    "I scan my environment for danger.",
    "Uncertainty makes me very uncomfortable.",
    "I hate to admit it, but I need constant reassurance in my personal relationships.",
    "I am definitely a very responsible person.",
    "Making changes in my life feels difficult and uncomfortable.",
    "I am watchful and suspicious by nature.",
    "I wish there were someone I could lean on.",
    "Sometimes I feel like a coward and a hero at the same time.",
    "I am a little anxious even when everything is fine.",
    "I am quite concerned about money matters because money helps me feel secure.",
    "Others can definitely rely on me.",
    "Even some of the closest people in my life might one day turn against me.",
    "At times, I get stuck overanalyzing things.",
    "I always remember that people can be two-faced.",
    "I keep my promises.",
    "I need a stable and secure job; being an entrepreneur isn’t my cup of tea.",
    "I use my good looks to affect others; being able to do that helps me feel less anxious.",
    "I probably missed many opportunities in life just because I wasn’t sure how things could work out.",
    "I always think of worst-case scenarios.",
    "I “feel the fear and do it anyway”.",
    "I am quite friendly.",
    "I am very protective.",
    "I tend to choose the same things over and over again because I know they worked well for me in the past.",
    "I don’t want to get into trouble with authority.",
    "When planning a trip, I consider different scenarios, including what to do if our money gets stolen, if we lose our documents, miss the airplane, etc.",
    "I am a future-oriented type.",
    "Being friendly is my way to disarm potential enemies.",
    "You will be very safe with me.",
    "I often wonder whether something was said just to be polite.",
    "I don’t trust easily.",
    "I must admit I have passive-aggressive tendencies.",
    "I am very helpful.",
    "I make up problems in my mind and then solve them before they even become a reality.",
    "I am either extremely confident or extremely insecure.",
    "I always stay alert because the world is a dangerous place.",
    "I force myself to face the things I fear.",
    "I always make sure that the bills are paid.",
    "My way of dealing with danger is to understand the threat and its possible impact on my life, then to prepare for it as much as possible.",
    "Sometimes I act boldly or even aggressively just to show everyone that I am not afraid and can’t be pushed around while the reality is different.",
    "I am a people-pleaser.",
    "I often have mixed feelings and contradictory inclinations. For example, I can be very calm and obedient for a while, and then I would decide to be more aggressive and rebellious. I switch back and forth between these states.",
    "Gathering information helps me keep myself safe.",
    "I own safety gear, just in case.",
    "I feel inferior to others.",
    "I look at the negative possibilities before allowing myself to consider the positive ones.",
    "I can’t rest until all my tasks are accomplished.",
    "My constant “what ifs” are quite tiring.",
    "I build alliances.",
    "I take safety standards very seriously.",
    "I am not one of those people who don’t care what others think of them.",
    "I try to guess or predict other people’s feelings and thoughts about me.",
    "I like stability.",
    "I always worry about my car getting stolen.",
    "Despite my obsession with security, I could put myself in a dangerous situation for the sake of saving someone (a person or an animal).",
    "I make sarcastic comments.",
    "Following rules gives me a sense of clarity, stability, and safety.",
    "As a child, I was taught that it was not OK to show my fear, so I learned to hide it and challenge it by putting myself in uncomfortable situations.",
    "As a child, I was taught that I shouldn’t be too strong and independent, so I learned to rely primarily on others, seek their support and advice, and avoid anything dangerous.",
    "I love to plan everything in detail.",
    "I actively work on forming friendships and strengthening them.",
    "I want my partner to make me feel secure and protected.",
    "I am somewhat indecisive.",
    "I like things to be clear and precise.",
    "Imagining the worst helps me prepare for it and potentially ward it off in advance.",
    "Sometimes I force myself to make fast decisions only to stop ruminating about my options and possible outcomes.",
    "I often second-guess my decisions.",
    "I am a fantastic researcher.",
    "Sometimes I feel embarrassed by too much attention.",
    "I get quite anxious at times.",
    "I question the real motives behind other people’s actions.",
    "I have a good sense of humor.",
    "To do my job properly, I need clear guidelines.",
    "I am a loyal person.",
    "When trying to support a friend in distress, I look for practical ways to solve their problem rather than just listening to them venting for hours.",
    "I have an organized mind.",
    "I need to know where I stand.",
    "I tend to overcompensate for my “flaws” by putting a lot of effort into everything I do for others.",
    "I am a hard worker.",
    "I am prepared for all kinds of disasters.",
    "I look for potential problems before it’s too late.",
    "I prepare for the future.",
    "I am an ambivert.",
    "Sometimes I fear getting too attached to someone or something because it would make me very vulnerable.",
    "I tend to overcommit myself.",
    "I am probably more of a pessimist than an optimist.",
    "I am very sensitive to criticism.",
    "I often feel strong emotions, but I do my best to hide them.",
    "I am never completely at ease.",
    "I am a good strategist.",
    "Focusing on worst-case scenarios prevents me from taking action.",
    "I tend to overprepare for everything.",
    "I rely on myself because I can’t rely on other people in my life.",
    "I often feel that other people judge me, which makes me feel uncomfortable.",
    "I am a realist.",
    "To keep enemies away, I want to appear strong, perhaps even a little intimidating.",
    "I often blame others for making me feel bad.",
    "I ask the hard questions.",
    "I listen to what people say and try to understand what they REALLY mean.",
    "I support others and hope that one day they will support me.",
    "Sometimes I am relieved to hear bad news because I can deal with some problems better than with uncertainty.",
    "I’m always imagining and planning for the worst.",
    "I often don’t trust people who are in authority.",
    "People say I am loyal, understanding, funny and compassionate.",
    "Most of my friends don’t have as much anxiety as I do.",
    "I act quickly in a crisis, but when things settle down I fall apart.",
    "When my partner and I are doing well in our relationship I find myself wondering what will happen to spoil it.",
    "Being sure I’ve made the right decision is almost impossible.",
    "I’m aware that fear has dictated many of my choices in life.",
    "I don’t like to find myself in unpredictable situations.",
    "I find it hard to stop thinking about the things I’m worried about.",
    "I’m generally not comfortable with extremes.",
    "I usually have so much to do it’s hard for me to finish tasks.",
    "I’m most comfortable when I’m around people who are pretty much like me.",
    "People tell me I can be overly pessimistic.",
    "I am slow to start, and once I do get started I find myself continuing to think about what could go wrong.",
    "I don’t trust people who give me too many compliments.",
    "It helps me to have things in some kind of order.",
    "I like to be told I am good at my job, but I get nervous when my boss wants to add to my responsibilities.",
    "I have to know people for a long time before I can really trust them.",
    "I am skeptical of things that are new and unknown.",
    "I am attracted to authority but distrustful of it at the same time.",
    "I am very emotional, although I don’t often show what I feel—except to those I’m close with—and even then, not always.",
    "If I make a mistake, I fear that everyone is going to jump down my throat.",
    "I feel more secure doing what’s expected of me than striking out on my own.",
    "I may not always agree with the rules—and I don’t always follow them—but I want to know what they are!",
    "I tend to have strong first impressions about people that are difficult to change.",
    "There are a few people I really look up to—they are sort of my heroes.",
    "I don’t like making big decisions, but I certainly don’t want anyone else to make them for me!",
    "Some people see me as jittery and nervous—but they don’t know the half of it!",
    "I know how much I mess up, so being suspicious of what others are up to just makes sense to me.",
    "I want to trust people, but often find myself questioning their motives.",
    "I am a real hard worker: I keep plodding along until the job gets done.",
    "I sound out the opinions of people I trust before I have to make a big decision.",
    "It’s really weird: I can be skeptical, even cynical, about all kinds of things, and then turn around and fall for something hook, line, and sinker.",
    "Anxiety seems to be my middle name."
  ]