 [
    "I am often able to find the positive potential in situations and people and I can become overly focused on that.",
    "I feel pulled toward interesting and enjoyable possibilities and push away from what may be painful or limiting.",
    "I tend to move on to what's next or more appealing when things get uncomfortable or difficult.",
    "I am often pulled by things that excite me and want the freedom to pursue them when they appear.",
    "I am on the lookout for opportunities that satisfy my interests and needs.",
    "I am enthusiastic.",
    "People should lighten up and be happy.",
    "I prepare for the future by planning for pleasant outcomes.",
    "I like having time to imagine possibilities.",
    "People sometimes see me as scattered.",
    "Others can be confining.",
    "I dislike limitations on my adventures.",
    "It can be difficult to commit to doing only one thing. Commitment feels constraining and limiting. I get pulled by things that interest or excite me and want the freedom to pursue them when they appear. I also may avoid uncomfortable or painful emotions by moving on to something else more pleasant or redirecting conversations going down that path to something lighter and more enjoyable.",
    "I want to keep the energy high.",
    "Sometimes I cancel plans with friends last minute because something more fun comes along.",
    "I often use words such as “amazing”, “astonishing”, “stunning”, “incredible”, etc.",
    "I am always on the go.",
    "I keep up with the latest trends.",
    "Being out there makes me feel alive.",
    "I am interested in collecting experiences.",
    "I just don’t want to feel limited.",
    "I really enjoy food. Sometimes I feel like I want to eat everything.",
    "I simply choose to feel good.",
    "Even when I am busy with something fun and exciting, my mind drifts off toward other things I could plan for the future.",
    "I am a very social and extroverted person.",
    "I never feel satisfied.",
    "I tend to focus on my own plans and preferences first.",
    "I avoid needy people.",
    "My self-control is weak.",
    "I always focus on the bright side.",
    "I don’t tend to examine my own thoughts and feelings too much.",
    "I seek peak experiences.",
    "I enjoy trying new and original ways of doing things.",
    "Even though I am interested in many subjects, I don’t take the time to study any of them in-depth.",
    "Sometimes I imagine positive and stimulating experiences to make myself feel better.",
    "I am naturally optimistic.",
    "I like to imagine an exciting future; it allows me to escape the not-so-pleasant here and now.",
    "I was a class clown as a child.",
    "Even a trip to a grocery store becomes an adventure when you are with me.",
    "I avoid asking for favors because I don’t want to feel indebted. It restricts my freedom.",
    "I want my life partner to be my playmate.",
    "I diffuse conflicts through diplomacy and humor.",
    "I am great at brainstorming but not so good at taking care of the details.",
    "I want to focus on what I want instead of complaining.",
    "I forgive easily.",
    "I don’t think much about the past.",
    "I simply discount criticisms.",
    "I build relationships just in case I need a specific kind of help one day.",
    "I resist being controlled by others.",
    "I can be very spontaneous.",
    "I work to support my lifestyle (i.e., travel, entertainment, experiences, etc.)",
    "Generally, I am very interested in other people, but I don’t feel the need to connect to them on a deeper level.",
    "Sometimes when conflicts arise, I might just leave without facing and resolving the problems.",
    "I admit that I tend to deny real problems.",
    "I don’t feel embarrassed if I can’t do something well.",
    "I prefer ideas and theory to implementation.",
    "I try to make others happy by keeping things fun and light even when I don’t feel happy myself.",
    "A smile is my default facial expression.",
    "Frankly speaking, I don’t spend much time thinking about how other people feel. I am mainly focused on myself.",
    "I am very adventurous.",
    "I secretly fear that if I stop acting happy and start being myself, others might not want me around.",
    "I am an expert multitasker.",
    "I want to feel free.",
    "Generally, I allow others to solve their own problems. I feel like most people should be able to do it.",
    "I adapt to new circumstances very quickly.",
    "Even when I am part of a team, I find ways to maintain my personal freedom to do what I want and when I want.",
    "Because I tend to focus on the fun and positive side of things, I might not be too compassionate at times.",
    "Planning experiences is almost as much fun as living them.",
    "I don’t tolerate boredom very well.",
    "Sometimes I get lost in my plans and fantasies.",
    "I am not afraid to try something new.",
    "I feel anxious when there isn’t anything to distract myself with. I feel that I need to keep going and going to protect myself from this anxiety.",
    "I start many projects but do not complete most of them.",
    "I enjoy entertaining others.",
    "I learn very quickly.",
    "I always have an alternative plan just in case things become too boring or don’t work out as I hoped.",
    "Sometimes I worry that I will not be able to sustain my excitement.",
    "Sometimes it’s hard to make decisions because by saying “yes” to something, you automatically say “no” to something else. I am concerned about missing out on other options.",
    "To be completely honest, I sometimes exaggerate to make things sound more fun.",
    "It’s like I look at the world through a filter. As much as I can, I filter out the bad stuff.",
    "I want to be the center of attention.",
    "I have a rich fantasy life.",
    "I can do many different things well.",
    "When something bad happens to me, I tell myself it could be worse. It is my way to feel better.",
    "I have a quick mind.",
    "When I feel anxious, I don’t try to understand its causes but try to distract myself instead.",
    "I reframe my setbacks as learning experiences.",
    "I have a lot of acquaintances, but I prefer to keep the connection light.",
    "I always look for ways to relieve negative feelings, such as boredom, discomfort, pain, etc.",
    "I feel irritated by people who are too slow.",
    "I love to tell stories.",
    "I have so many ideas!",
    "I don’t commit easily because I need to feel that I have options to choose from (relationships, education, jobs, places to live, etc.)",
    "I think a lot of people make themselves more miserable through their bad attitudes.",
    "If someone speaks too much about their problems, complains a lot, or is just being negative, I usually change the subject because it’s too much for me.",
    "I am one of those people who can talk a lot about their plans without actually doing anything.",
    "I am always up for something new.",
    "I love to entertain guests.",
    "I don’t dwell on my negative emotions; I move on rather quickly.",
    "Positive thinking really works for me.",
    "My interests are very diverse.",
    "I get bored with routine. Every once in a while, I do something different, even if it’s simply taking another road home.",
    "I am always planning my next trip.",
    "I share my thoughts and feelings freely, even if others may disagree.",
    "Most of the time, I intentionally ignore difficult and painful things.",
    "I am a very solution-oriented type. Instead of dwelling on problems, I immediately begin looking for solutions.",
    "I am excited about my future.",
    "When something negative happens, I always tell myself it’s just temporary.",
    "I love sharing my experiences with others.",
    "I always look for good opportunities.",
    "I am an escapist — playing too many games, watching too many movies, reading too much fiction, etc., to avoid dealing with reality.",
    "I am drawn to experimentation.",
    "Sometimes I just can’t say no to myself.",
    "I’m always the first person up for a last-minute adventure.",
    "I am an optimist to a fault.",
    "I don’t like making hard and fast commitments to things.",
    "I suffer from FOMO—fear of missing out.",
    "Anticipation is the best part of life.",
    "People close to me say I can be argumentative and act superior.",
    "Variety and spontaneity are the spice of life.",
    "Sometimes I get so eager for the future I can hardly wait for it to get here.",
    "It’s hard for me to finish things. When I get close to the end of a project I start thinking about the next thing, and then I get so excited I sometimes just move on.",
    "I usually avoid heavy conversations and confrontations.",
    "When people I care about are having a hard time, I help them look at the bright side of a situation.",
    "Other people think I am sure of myself, but I have lots of doubts.",
    "I’m popular and have lots of friends.",
    "When things get too serious for too long I usually find a way to get people to lighten up, often by telling jokes and funny stories.",
    "I don’t like endings, so I usually wait for people to break up with me.",
    "I quickly get bored with the same routine and like to try new things.",
    "Almost everything can be more fun and entertaining with a little effort.",
    "I think people worry more than they should.",
    "Life is better than people imagine. It’s all about how you explain things to yourself.",
    "I don’t like it when people have expectations of me.",
    "I love traveling and discovering different kinds of foods, people, and experiences—the whole fabulous whirlwind of life!",
    "My calendar is usually full, and I like to keep it that way: no grass is going to grow under my feet!",
    "What’s important to me is excitement and variety rather than comfort and playing it safe—although I’ll take my comforts wherever I can find them.",
    "My mind is always chattering—sometimes it seems like I’m thinking about ten things at once!",
    "One thing I absolutely cannot stand is being bored—and I make sure that I am never boring myself.",
    "I’m pretty committed when I’m in a relationship, but when it’s over, I move on.",
    "I am curious and adventurous and am usually the first one of my friends to try whatever is new and interesting.",
    "When I no longer enjoy doing something, I stop doing it.",
    "I’m not just a “fun person”—there is a serious, even dark side to me, although I do not like to go there very much.",
    "I’m good at the big picture, not so much the little details: it’s more enjoyable for me to brainstorm a lot of new ideas than to get involved with implementing them.",
    "When I really want something, I usually find a way to get it.",
    "Things get me down once in a while, but I quickly pop back up again.",
    "One of my main problems is that I am easily distracted and can get too scattered.",
    "I tend to spend more money than I probably should.",
    "Other people are great to have along—as long as they want to go where I’m going."
  ]
