[
  "I am supportive and nurturing of others but can feel obligated when others are the same for me.",
  "I am good at seducing or pulling others closer to me through an emotional connection or relationship.",
  "I can read the needs and wants of those around me to gain influence and importance in their lives.",
  "I read the desires and needs of others so I can be of support.",
  "I forget my own needs because my attention is on the needs of others.",
  "People should show their appreciation for one another more.",
  "I feel pressure to unselfishly give of myself in service to others.",
  "I am attentive to the emotions of others.",
  "My identity forms around what people need from me.",
  "I like to be desired and needed.",
  "I avoid being needy.",
  "I feel valued when people appreciate the things I do for them.",
  "It can be difficult for me to know what I need or want because my attention goes out towards what other people need and want. Sometimes I seem to know more about what others need or want than they do. I often respond to what others need or want by doing things for them, supporting them emotionally, or presenting myself in a way that draws them closer to me.",
  "Pleasing others is one of my top priorities and an important source of enjoyment in life.",
  "I readily give compliments.",
  "I am deeply invested in other people.",
  "The more people are indebted to me, the safer I feel.",
  "Frankly speaking, I feel disappointed when others reject my assistance. It makes me feel unwanted.",
  "I avoid conflicts.",
  "I like to 'fix' things for others.",
  "I can strike up a conversation with almost anyone.",
  "I am a touchy-feely type.",
  "I think I can read people’s emotions.",
  "Deep inside, I suspect that people love me for what I do for them and not for who I am.",
  "I work overtime to please my boss and/or colleagues.",
  "I don’t know how to reject other people’s requests. It’s easier to give them what they want than disappoint someone.",
  "I notice little positive things about people that others usually miss.",
  "I make sure that people feel welcome in my home.",
  "I am not particularly assertive.",
  "I encourage others to share their feelings.",
  "I really don’t know how to give negative feedback.",
  "I work to build a beautiful environment that impresses my guests.",
  "I avoid expressing any strong feelings and opinions to avoid polarizing someone.",
  "I think I might have codependent tendencies.",
  "I worry about hurting someone’s feelings unintentionally.",
  "I appreciate the fact that people choose me to share their secrets with.",
  "To preserve peace, I apologize and blame myself a lot.",
  "I take care of others, hoping that they take care of me.",
  "I need to be in a relationship. I am terrified of being single.",
  "My well-being, perhaps even survival, depends on my likeability.",
  "I hide the parts of myself that I think are unlovable.",
  "To make a decision, I consider different options and how they affect the people in my life.",
  "I ruminate about other people holding a grudge against me.",
  "To tell the truth, I sometimes exaggerate my problems and health concerns to get a little more attention.",
  "I am an empath, no doubt about it.",
  "I am extremely sensitive to criticism.",
  "I always sugarcoat things out of fear of hurting others.",
  "I was taken advantage of, emotionally, financially, or professionally.",
  "I rescue animals.",
  "To be honest, my self-esteem is defined by other people’s appreciation, love, and attention.",
  "I want to appear upbeat and cheery.",
  "I guess I am not very good at setting boundaries.",
  "I have difficulty articulating my needs and I hope that others will figure them out without me having to explain anything.",
  "I have an extensive social network.",
  "I neglected myself while trying to make others happy and comfortable, and my health shows it.",
  "I am a very trusting person, perhaps even more trusting than I should be.",
  "I connect with everyone, from the janitor to the boss.",
  "I sacrifice my time and energy to help others, sometimes spreading myself too thin.",
  "I am a nurturer, and I assume this role automatically, without thinking.",
  "I often find something good to say about some of the most difficult people.",
  "I always smile at others.",
  "Honestly, I am terrified of being abandoned.",
  "My personal relationship has to be very romantic.",
  "I am a good listener.",
  "I need to be with people.",
  "I want to win as many friends as possible.",
  "I always do my best to sound positive.",
  "What I really want is that someone takes care of me.",
  "I feel responsible for other people’s happiness.",
  "I dwell on my perceived shortcomings.",
  "Other people’s opinions about me are definitely important to me.",
  "I must admit I tend to go overboard with gifts.",
  "I love being in the know.",
  "I feel drained from overdoing things for others, but I continue doing it regardless.",
  "People rely on me, and I am proud of it.",
  "Maybe I am a little possessive.",
  "I am looking for love by giving love.",
  "I am one of the most supportive people you’ll ever meet.",
  "I sometimes feel jealous of my friends’ other friendships.",
  "I want other people to need me.",
  "I criticize myself for not being good enough or patient enough.",
  "I consider others’ preferences when choosing what to wear.",
  "Sometimes I feel that people around me are so ungrateful!",
  "It’s very difficult for me to let go when a relationship doesn’t work out.",
  "I am a very people-oriented person.",
  "I don’t want to depend on others, but I want them to depend on me.",
  "I am often concerned about being misunderstood.",
  "I like to hear that I am indispensable.",
  "I have a tendency to advise others because I believe it can help.",
  "I secretly like it when others are dependent on me.",
  "I am a generous person.",
  "I enjoy making others feel good.",
  "I would rather be in a subordinate position than a leader.",
  "I adapt to the other person’s needs.",
  "I probably am very emotional.",
  "I hint at what I need, but others often don’t pick up the hints despite me doing everything for them, which makes me sad.",
  "I love to give, but it’s important to me that others reciprocate too.",
  "I definitely get frustrated with others at times, but I hide my frustration behind a smile.",
  "Being alone feels very uncomfortable.",
  "I wish people appreciated everything I do for them.",
  "I feel upset if I can’t win others over.",
  "I often say 'yes' when I want to say 'no'.",
  "I suppress my real feelings to avoid disapproval from others.",
  "I want to appear kind and considerate.",
  "I am not even sure what my needs are.",
  "I cancel my plans if a friend wants to vent to me.",
  "I try to become what each person wants to see; it’s like I have many different personalities at the same time.",
  "My friends are all very different.",
  "I feel used.",
  "I think I can feel other people’s feelings as if they were my own.",
  "I am preoccupied with other people’s needs.",
  "To be honest, I sometimes try to guilt-trip people into doing what I want.",
  "I don’t stay alone long enough to understand myself.",
  "When it comes to taking care of others, I don’t know how or when to say no.",
  "I am a great listener, and I remember the stories that make up people’s lives.",
  "I am anxious to overcome misunderstandings in a relationship.",
  "I feel drawn to influential or powerful people.",
  "People think I’m psychic because I usually know what other people need or want.",
  "Even people I don’t know well share deep stuff about their lives with me.",
  "It seems like people who love me should already know what I need.",
  "I need to be acknowledged and appreciated for my contributions.",
  "I’m more comfortable giving than receiving.",
  "I like my home to feel like a safe and welcoming place for family and others.",
  "I care a great deal about what people think of me.",
  "I want other people to think I love everyone, even though I don’t.",
  "I like it when the people who love me do something unexpected for me.",
  "Lots of people ask me for help, and it makes me feel valuable.",
  "When people ask me what I need, I have no idea how to answer.",
  "When I’m tired I often feel like people take me for granted.",
  "People say my emotions feel over-the-top.",
  "I feel angry and conflicted when my needs conflict with others.",
  "Sometimes it’s hard for me to watch movies because I find it almost unbearable to see people suffer.",
  "I worry a lot about being forgiven when I make mistakes.",
  "My genuine concern for others makes me become deeply involved with them—with their hopes, dreams, and needs.",
  "It feels natural to be friendly: I strike up conversations easily and am on a first-name basis with everyone.",
  "I have found that people respond warmly to me when I give them some attention and encouragement.",
  "I cannot see a stray dog in the street without wanting to bring it home.",
  "I feel good about the fact that I am a thoughtful, generous person.",
  "It’s hard for me to take credit for the many things I’ve done for people, but it bothers me a lot when they don’t seem to notice or care.",
  "It is true that I often do more for others than I should—I give away too much and do not think of myself enough.",
  "I often find myself trying to win people over—especially if they initially seem indifferent to me.",
  "I take special joy in entertaining and hosting my friends and 'extended family.'",
  "I can be warm and supportive, but there is more steel in me than others might think.",
  "I am able to express my feelings for people more openly than most.",
  "I make special efforts to know what’s going on with the people I care about.",
  "I see myself as something of a 'healer of broken hearts.'",
  "My health and finances have frequently suffered because I put other people’s needs and interests before my own.",
  "I love to knock myself out to make people feel welcomed and appreciated."
]