[
  "I avoid mistakes or doing things wrong so as not to be personally blamed or criticized for it.",
  "I point out to others the “right way” that something should be done in order to help or correct them.",
  "I know what's appropriate or correct behavior and act accordingly, others should as well.",
  "I try to avoid negative consequences by not making mistakes.",
  "I can be critical of others when they behave unacceptably.",
  "People need to do what is right.",
  "I behave in a way that everyone should.",
  "I monitor myself to make sure I do what I need to do and behave as I should.",
  "People can mistake my advice as being judgmental even when I am just trying to be helpful.",
  "I am right.",
  "I like to work to improve things.",
  "I correct others.",
  "It can be difficult for me NOT to notice when something has been done wrong or when people behave inappropriately, especially when people know better or should know better. I monitor myself to correct or improve what I do or how I behave so that I do what I should and what is right. This may carry over to criticizing, judging, or correcting others as well.",
  "I like to do things properly.",
  "I always follow the rules.",
  "I feel like I need to earn relaxation time.",
  "Although I am highly critical, hearing criticism from others is extremely hard.",
  "I am a self-disciplined person.",
  "I feel a strong sense of responsibility.",
  "I am one of the first in the office and the last to leave at night.",
  "I often talk about how things should be.",
  "I am often anxious because of my constant need to measure up.",
  "I want to avoid fault and blame.",
  "I judge myself and others by what they do, not what they say.",
  "I am into self-improvement.",
  "I obsess about what could have been if everyone was doing their job.",
  "I dwell on mistakes.",
  "I feel like I have to compensate for the irresponsibility and sloppiness of my family members and colleagues.",
  "I am rarely satisfied with my results. I always feel that I need a little more time to work on things to make them perfect.",
  "I like to organize everything.",
  "I work to bring stability to my life.",
  "I worry a lot about my future.",
  "I try to be extra nice to those I am dissatisfied with.",
  "I don’t want to waste my time.",
  "I want to control everything in my environment.",
  "I mostly wear classic clothing.",
  "I always complete my projects on time. In my mind, there is no other way!",
  "As a teen, I acted older than my age.",
  "I worry and fuss even when things go well.",
  "I always park my car right between the lines because that’s the way I want everyone to behave.",
  "I feel so bad when I fail to achieve my ideal vision.",
  "I always show up on time and expect others to do the same.",
  "I set high standards for myself and others.",
  "I want to change other people, to make them more perfect.",
  "I often feel a sense of guilt about not being good enough.",
  "I tend to micromanage.",
  "I focus on what is not working rather than what is.",
  "I always think out things carefully before acting.",
  "I judge things against my inner ideal, which automatically makes me notice all imperfections and errors.",
  "I constantly evaluate everything — people, situations, my own performance — to see how it compares to what it should be.",
  "I try to have a correct posture at all times.",
  "I control my impulses, emotions and needs to avoid doing something inappropriate and embarrassing myself.",
  "I rarely praise others or give compliments.",
  "I make sure to eat a balanced diet or strictly follow a specific diet that I believe to be healthy.",
  "I want to be a good example for others.",
  "I suppress my negative or inappropriate emotions and express their exact opposite.",
  "I follow the rules because you can’t be blamed when you do everything right, even when things don’t work out.",
  "I try my best to keep my strong emotions under control.",
  "I wish others appreciated my efforts.",
  "I always make sure that everything is done right and finished.",
  "I obsess about what should be done and how it should be done.",
  "My work environment is always clean and organized.",
  "I always got straight A’s as a child.",
  "I always feel like there is room for improvement.",
  "I make lists to plan everything and use them later to check off tasks when they are done.",
  "I am quite critical.",
  "Following rules and routine gives me a sense of security.",
  "I take time to research and think about everything carefully before deciding.",
  "I aspire to be a respectable and reputable member of society.",
  "I tend to be more on a serious side.",
  "If somebody is wrong about something, I will point it out to them.",
  "I practice a lot.",
  "There is always this conversation in my mind about what needs to be done next.",
  "Sometimes I procrastinate a task because I can’t execute it flawlessly.",
  "I never had motivation issues.",
  "I need to always be on high alert to ensure that things happen the way I planned or prevent disasters.",
  "I worry that other people judge me.",
  "I tend to get envious/jealous.",
  "I constantly monitor my own actions and behavior.",
  "I am not particularly flexible or adaptable.",
  "I just want to make things right.",
  "Sometimes I judge other people to make myself feel better about my own mistakes.",
  "I change my clothes frequently to make sure they always look fresh and clean.",
  "Decision-making makes me quite anxious because I am afraid to make mistakes and choose a less-than-perfect option.",
  "I work hard.",
  "I often resent others because they aren’t helping or doing their job.",
  "Generally, I think in black-and-white terms. I like things to be clearly defined.",
  "I do things well, or I don’t do them at all.",
  "I am focused on the future.",
  "I am very self-aware; it’s important to me to dress and behave appropriately.",
  "I am a very reliable person.",
  "Perhaps I work too much.",
  "To be honest, I am not the most generous person.",
  "At home, I clean, wash, straighten and check things all the time.",
  "I am my own worst critic.",
  "I am never completely relaxed.",
  "I love to teach.",
  "I make an effort to look extra clean and tidy.",
  "I hardly ever do anything spontaneously.",
  "I often refuse to participate in activities because I cannot perform to a high enough standard.",
  "I follow an exercise program, and I am very serious about it.",
  "I shower more than once daily.",
  "I find it very difficult to delegate tasks. If I want the job to be done correctly, I have to do it myself.",
  "I feel overburdened by all the things I have to do.",
  "I want to plan everything out.",
  "I have to provide a sense of stability to my family.",
  "I worry about getting in trouble or something going wrong.",
  "Sometimes I feel the need to prove that I am right and others are wrong to have some power over them.",
  "I worry about having to support others.",
  "I become super polite when angry.",
  "I take pleasure in a job well done.",
  "If I make a mistake, I return to the beginning and start over.",
  "I would rather take time to study the manual than embarrass myself by asking an obvious question.",
  "People have told me I can be overly critical and judgmental.",
  "I beat myself up when I make mistakes.",
  "I don’t feel comfortable when I try to relax. There is too much to be done.",
  "I don’t like it when people ignore or break the rules, like when the person in the fast lane at the grocery store has more items than allowed.",
  "Details are important to me.",
  "I often find that I’m comparing myself to others.",
  "If I say I’ll do it, I’ll do it.",
  "It is hard for me to let go of resentment.",
  "I think it is my responsibility to leave the world better than I found it.",
  "I have lots of self-discipline.",
  "I try to be careful and thoughtful about how I spend money.",
  "It seems to me that things are either right or wrong.",
  "I spend a lot of time thinking about how I could be a better person.",
  "Forgiveness is hard for me.",
  "I notice immediately when things are wrong or out of place.",
  "I worry a lot.",
  "I am really disappointed when other people don’t do their part.",
  "I like routine and don’t readily embrace change.",
  "I do my best when working on a project, and I wish others would do the same, so I wouldn’t have to redo their work.",
  "I often feel like I try harder than others to do things correctly."
]